<template>
  <section class="questions block graybg">
    <div class="questions__container">
      <Title class="questions__title">Ответы на популярные вопросы</Title>
      <div class="questions__cards">
        <Question
          question="Входят ли материалы в стоимость ремонта?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
        <Question
          question="Кто будет ремонтировать мою квартиру?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
        <Question
          question="Как оплачиваются услуги и материалы?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
        <Question
          question="Когда готовы приступить к работе?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
        <Question
          question="Беретесь ли вы за мелкий ремонт?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
        <Question
          question="Нужно ли вывозить мебель из квартиры на время ремонта?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
        <Question
          question="Какие строительные материалы вы используете? Какого качества?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
        <Question
          question="Можно ли жить во время ремонта в квартире?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
        <Question
          question="Каковы условия гарантии на ремонт?"
          answer="Lorem Ipsum - это текст-рыба, часто используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной рыбой для текстов на латинице с начала XVI века. В то время некий безымянный печатник создал большую коллекцию размеров и форм шрифтов, используя Lorem Ipsum для распечатки образцов."
        />
      </div>
    </div>
  </section>
</template>

<script lang="ts">
import { Vue, Component } from "vue-property-decorator";
import Question from "@/components/Question.vue";
import Title from "@/components/Title.vue";
@Component({
  components: {
    Question,
    Title,
  },
})
export default class Questions extends Vue {}
</script>

<style lang="scss" scoped>
@import "@/assets/scss/variables.scss";
.questions {
  &__title {
    margin-bottom: 60px;
    @media (max-width: 691px) {
      margin-bottom: 35px;
    }
  }
  &__cards {
    display: flex;
    flex-direction: column;
    gap: 10px;
  }
}
</style>
